>### **HOW TO FIND VERSION OF PANDAS**

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

>### **ANOTHER WAY**

In [4]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 0691c5cf90477d3503834d983f69350f250a6ff7
python                : 3.12.2
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 42 Stepping 7, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.2.3
numpy                 : 2.2.4
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 24.0
Cython                : None
sphinx                : None
IPython               : 9.0.2
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : None
lxml.etree            : None
matplotlib            : 3.10.1
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.2
qtpy                  : None
pyqt5                 : None

>##### **NAME:SYED SUFIYAN JAWAID**
>##### **DATE:7-April-2025**
>##### **TOPIC: PANDAS TIPS AND TRICKS**
>##### **EMAIL: sufiyanjawaid640@gmail.com**

># **PANDAS TIPS AND TRICKS**

># **1- MAKE DATAFRAMES**

In [5]:
df=pd.DataFrame({'moblie':[455,567,675],'price':[25000,50000,75000]})

In [6]:
df

   moblie  price
0     455  25000
1     567  50000
2     675  75000

># **2- CREATE ARRAY USING NUMPY**

In [7]:
import numpy as np

In [8]:
arr=np.array([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
pd.DataFrame(np.random.rand(10,5))

          0         1         2         3         4
0  0.108060  0.135147  0.791080  0.887397  0.034527
1  0.512993  0.461155  0.330084  0.654054  0.714542
2  0.656472  0.188719  0.391463  0.719471  0.262690
3  0.368504  0.930296  0.248780  0.256040  0.139378
4  0.687994  0.336220  0.877232  0.234611  0.062921
5  0.483569  0.483240  0.034296  0.485477  0.811859
6  0.551872  0.474822  0.390450  0.520144  0.157848
7  0.882488  0.843811  0.778811  0.483407  0.059047
8  0.947213  0.715779  0.935019  0.723970  0.870125
9  0.029095  0.674779  0.734216  0.019229  0.925864

># **3- GIVE COLUMN NAMES**

In [10]:
pd.DataFrame(np.random.rand(10,5),columns=list('abcde'))

          a         b         c         d         e
0  0.954369  0.432061  0.701085  0.434828  0.776227
1  0.447610  0.182054  0.834823  0.886532  0.524494
2  0.380578  0.689504  0.130822  0.194808  0.651995
3  0.971732  0.094524  0.696085  0.998780  0.219593
4  0.404615  0.664885  0.609876  0.405717  0.745183
5  0.081130  0.143273  0.245982  0.683380  0.836961
6  0.511757  0.941730  0.938240  0.445716  0.132822
7  0.411122  0.606786  0.626260  0.494129  0.560971
8  0.101729  0.800671  0.148174  0.284761  0.244498
9  0.136732  0.611483  0.983774  0.817480  0.722237

># **4- HOW TO RENAME COLUMNS**

In [11]:
df.rename(columns={'moblie':'about moblie','price':'tem price'},inplace=True)
df

   about moblie  tem price
0           455      25000
1           567      50000
2           675      75000

># **ANOTHER WAY**

In [12]:
df.columns=['MOBLIE','PRICE']
df

   MOBLIE  PRICE
0     455  25000
1     567  50000
2     675  75000

># **5- Replace column with - and _**

In [13]:
df=df.add_prefix('col_')

In [14]:
df

   col_MOBLIE  col_PRICE
0         455      25000
1         567      50000
2         675      75000

In [16]:
df=df.add_suffix('_col')
df

   col_MOBLIE_col_col  col_PRICE_col_col
0                 455              25000
1                 567              50000
2                 675              75000